:PROPERTIES:
:header-args: :eval no :exports both
:END:
#+TITLE: AoC 2025
#+SUBTITLE: My solutions for Advent of Code 2025
#+AUTHOR: Rens Oliemans
#+OPTIONS: toc:nil ^:t num:nil

Welcome to my solution page for [[https://adventofcode.com/2025][Advent of Code 2025]]. They are all in Clojure, you can find [[https://codeberg.org/RensOliemans/AoC][the git repo here]].  I'm rather new to Clojure—if you see any improvements, please don't hesitate to contact me via email (=something@myname.nl=) or create an issue.

** Part 2
Part two is somewhat similar, except that the parsing is now more difficult. I define =group-while=, a function that's quite badly named, suggesting generality while it really is mostly useful for Advent of Code 2025, Day 6, Part 2. Here it is:

#+begin_src clojure :eval yes :results silent
  (defn group-while
    "Groups a collection into subgroups as long as `pred` holds."
    [pred coll]
    (loop [res [[]]
           i 0]
      (if (= i (count coll))
        res
        (let [x (nth coll i)]
          (if (pred x)
            (recur (assoc res (dec (count res)) (conj (last res) x)) (inc i))
            (recur (conj res []) (inc i)))))))
#+end_src

And it allows you to group a collection into subcollections. Each element =x= is kept in a group as long as =(pred x)= holds. An example shows the result:

#+NAME: group-while-example
#+begin_src clojure :eval yes
  (group-while odd? [1 3 5 2 3 5 6 7 8 9])
#+end_src

#+RESULTS: group-while-example
: [[1 3 5] [3 5] [7] [9]]

For part two, a logical =pred= is whether the line contains non-whitespace characters. As long as it does, we're still in the same "problem". After this we can reduce, where =(map #(first (s/parse-ints (str/join %))) row)= does the heavy lifting. =s/parse-ints= parses all integers and throws away the rest (like whitespace or operators). Since it's already transposed, this is enough - the rest is similar to part one.

#+begin_src clojure
  (defn part2 [input]
    (let [inp (->> (s/parse-lines input)
                   v/transpose
                   (group-while (fn [x] (not (every? #(= \space %) x)))))]
      (reduce (fn [total row]
                (let [op (last (first row))]
                  (+ total
                     (condp = op
                       \* (reduce * (map #(first (s/parse-ints (str/join %))) row))
                       \+ (reduce + (map #(first (s/parse-ints (str/join %))) row))))))
              0
              inp)))
#+end_src

